Merge branch 'dev' into fix-infinite-loop
